**free
/if defined(SERVICE_IWS_H_DEFINED)
/eof
/endif
/define SERVICE_IWS_H_DEFINED
/include 'cmagic.rpgleinc'
/include 'global.rpgleinc'
/include 'httpRest.rpgleinc'

dcl-ds service_item_iws_t qualified template;
  id varchar(3);
  nom varchar(36);
  idManageur varchar(6);
  idServiceAdmin varchar(3);
  site varchar(16);
end-ds;

dcl-pr service_getlist_iws extproc(*dclcase);
  items_LENGTH int(10);
  items likeDS(service_item_iws_t) dim(HTTPREST_MAX_ITEMS);
  totalCount like(CMAGIC_totalCount);
  errors_LENGTH int(10);
  errors likeDS(errorItem) dim(HTTPREST_MAX_ERRORS);
  httpStatus like(HTTPREST_httpStatus);
  httpHeaders like(HTTPREST_httpHeader) dim(HTTPREST_nbHeaders);
end-pr;
dcl-ds service_detail_iws_t qualified template;
  id varchar(3);
  nom varchar(36);
  idManageur varchar(6);
  idServiceAdmin varchar(3);
  site varchar(16);
end-ds;

dcl-pr service_getone_iws extproc(*dclcase);
  id varchar(3) const;
  item likeDS(service_detail_iws_t);
  errors_LENGTH int(10);
  errors likeDS(errorItem) dim(HTTPREST_MAX_ERRORS);
  httpStatus like(HTTPREST_httpStatus);
  httpHeaders like(HTTPREST_httpHeader) dim(HTTPREST_nbHeaders);
end-pr;
