**free
/if defined(service_H_DEFINED)       
/eof                               
/endif                             
/define service_H_DEFINED  
/include 'cmagic.rpgleinc'
/include 'global.rpgleinc'
/include 'employee.rpgleinc'

// ------------------------------------------------------------------//
// printf (c)                                                       //
// ------------------------------------------------------------------//
dcl-enum service_listeAction qualified;
  creation 'create';
  modification 'update';
  suppression 'delete';
  consultation 'read';
end-enum;

///
// ID Service template
///
dcl-ds service_id_t template qualified;
  code char(3);
 end-ds;

///
// service Detail template
///
dcl-ds service_detail_t template qualified;
  id likeDS(service_id_t);
  nom varchar(36);
  idManageur likeDS(employee_id_t);
  idServiceAdmin likeDS(service_id_t);
  site char(16);
end-ds;
dcl-ds service_detail_sql_t template qualified;
  code like(service_id_t.code);
  nom varchar(36);
  codeManageur like(employee_id_t.code);
  codeServiceAdmin like(service_id_t.code);
  site char(16);
end-ds;
///
// service List Item template
///
dcl-ds service_item_t template qualified;
  id likeDS(service_detail_t.id);
  nom like(service_detail_t.nom);
end-ds;
dcl-ds service_item_sql_t template qualified;
  code like(service_id_t.code);
  nom varchar(36);
end-ds;

///
// Search services
//
// Returns a paginate list of found services 
//  regarding the search critÃ©ria send in the context.
//
// @param **in**  context (pagination,sort,filter) critÃ©rias
// @param **out** itemCount count of item found based on filter critÃ©rias
// @param **out** items pointer to the linked list of item service
// @param **out** errors list of errors
// @return *on if ok, *off if error
// @throws ....
// @tag Service
// @tag CMAGIC
///
dcl-pr service_search ind extproc(*dclcase);
   context likeDS(CMAGIC_context) const;
   totalCount like(CMAGIC_totalCount);
   items pointer;
   errors likeDS(GLOBAL_listError);
end-pr;

///
// get detail service by ID
//
// Returns a detail service
//
// @param **in**  id service ID
// @param **out** detail service detail
// @param **out** errors list of errors
// @return *on if ok, *off if error
// @throws ....
// @tag Service
// @tag CMAGIC
///
dcl-pr service_getByID ind extproc(*dclcase);
  id likeDS(service_detail_t.id) const;
  detail likeds(service_detail_t);
  errors likeDS(GLOBAL_listError);
end-pr;
///
// display  service
//
// - calls getByID
// - display the detail service on screen
//
// @param **in**  id service ID
// @param **out** errors list of errors
// @return *on if ok, *off if error
// @throws ....
// @tag Service
// @tag CMAGIC
///
dcl-pr service_display ind extproc(*dclcase);
  id likeDS(service_detail_t.id) const;
  errors likeDS(GLOBAL_listError);
end-pr; 
///
// create service
//
// Returns the id of created service
//
// @param **in** detail service detail
// @param **out**  id service ID
// @param **out** errors list of errors
// @return *on if ok, *off if error
// @throws ....
// @tag Service
// @tag CMAGIC
///
dcl-pr service_create ind extproc(*dclcase);
  detail likeds(service_detail_t) const;
  id likeDS(service_detail_t.id);
  errors likeDS(GLOBAL_listError);
end-pr; 

///
// change service
//
// Returns *on if ok, *off if error
//
// @param **in**  id service ID
// @param **in** detail service detail
// @param **out** errors list of errors
// @return *on if ok, *off if error
// @throws ....
// @tag Service
// @tag CMAGIC
///
dcl-pr service_update ind extproc(*dclcase);
  id likeDS(service_detail_t.id) const;
  detail likeds(service_detail_t) const;
  errors likeDS(GLOBAL_listError);
end-pr; 

///
// delete service
//
// Returns *on if ok, *off if error
//
// @param **in**  id service ID
// @param **out** errors list of errors
// @return *on if ok, *off if error
// @throws ....
// @tag Service
// @tag CMAGIC
///
dcl-pr service_delete ind extproc(*dclcase);
  id likeDS(service_detail_t.id) const;
  errors likeDS(GLOBAL_listError);
end-pr;

///
// check if sended action is valid for service.
//
// Returns a list of errors if service is not valid for the action
//
// @param **in**  action service action
// @param **in**  beforeDetail service detail before action
// @param **in**  afterDetail service detail after action
// @param **out** errors list of errors
// @return *on if ok, *off if error
// @throws ....
// @tag Service
// @tag CMAGIC
///
dcl-pr service_isValid ind  extproc(*dclcase);
  action like(GLOBAL_codeAction) Const; // in service_listeAction
  beforeDetail likeds(service_detail_t) Const;
  afterDetail likeds(service_detail_t) Const;
  errors likeDS(GLOBAL_listError);
end-pr;


// ========================================
// Configuration des champs supportés pour Service
// ========================================

///
// Get Service supported fields configuration
//
// Returns pointer to supported fields configuration for Service entity.
// Used by REST services for filtering and validation.
//
// @return pointer to supported fields array
// @tag Service
// @tag REST
// @tag Configuration
///
dcl-pr service_getSupportedFields ind  extproc(*dclcase);
      supportedFields likeds(CMAGIC_supportedFields);
      errors likeDS(GLOBAL_listError);
end-pr;
