**free
/if defined(TESTSERVICE_H_DEFINED)
/eof
/endif
/define TESTSERVICE_H_DEFINED

/include 'cmagic.rpgleinc'
/include 'global.rpgleinc'

// ============================================================================
// STRUCTURES DE DONNÃ‰ES
// ============================================================================

///
// TESTSERVICE Detail template
///
dcl-ds testservice_detail_t template qualified;
  dcl-ds id;
    code char(3);
  end-ds;
  // TODO: Ajouter autres champs selon structure table DEPARTMENT
end-ds;

///
// TESTSERVICE List Item template
///
dcl-ds testservice_item_t template qualified;
  id likeDS(testservice_detail_t.id);
  // TODO: Ajouter champs affichage liste
end-ds;

// ============================================================================
// PROTOTYPES - MODULE MÃ‰TIER
// ============================================================================

///
// Search TESTSERVICEs
//
// @param **in**  context (pagination,sort,filter)
// @param **out** totalCount count of items found
// @param **out** items pointer to linked list
// @param **out** errors list of errors
// @return *on if ok, *off if error
///
dcl-pr testservice_search ind extproc(*dclcase);
  context likeDS(CMAGIC_context) const;
  totalCount like(CMAGIC_totalCount);
  items pointer;
  errors likeDS(GLOBAL_listError);
end-pr;

///
// Get TESTSERVICE by ID
//
// @param **in**  id TESTSERVICE ID
// @param **out** detail TESTSERVICE detail
// @param **out** errors list of errors
// @return *on if ok, *off if error
///
dcl-pr testservice_getByID ind extproc(*dclcase);
  id likeDS(testservice_detail_t.id) const;
  detail likeds(testservice_detail_t);
  errors likeDS(GLOBAL_listError);
end-pr;

///
// Create TESTSERVICE
//
// @param **in**  detail TESTSERVICE detail
// @param **out** id generated ID
// @param **out** errors list of errors
// @return *on if ok, *off if error
///
dcl-pr testservice_create ind extproc(*dclcase);
  detail likeds(testservice_detail_t) const;
  id likeDS(testservice_detail_t.id);
  errors likeDS(GLOBAL_listError);
end-pr;

///
// Update TESTSERVICE
//
// @param **in**  id TESTSERVICE ID
// @param **in**  detail TESTSERVICE detail
// @param **out** errors list of errors
// @return *on if ok, *off if error
///
dcl-pr testservice_update ind extproc(*dclcase);
  id likeDS(testservice_detail_t.id) const;
  detail likeds(testservice_detail_t) const;
  errors likeDS(GLOBAL_listError);
end-pr;

///
// Delete TESTSERVICE
//
// @param **in**  id TESTSERVICE ID
// @param **out** errors list of errors
// @return *on if ok, *off if error
///
dcl-pr testservice_delete ind extproc(*dclcase);
  id likeDS(testservice_detail_t.id) const;
  errors likeDS(GLOBAL_listError);
end-pr;

///
// Validate TESTSERVICE
//
// @param **in**  detail TESTSERVICE detail
// @param **out** errors list of errors
// @return *on if valid, *off if invalid
///
dcl-pr testservice_isValid ind extproc(*dclcase);
  detail likeds(testservice_detail_t) const;
  errors likeDS(GLOBAL_listError);
end-pr;

///
// Get supported fields configuration
//
// @param **out** supportedFields fields configuration
// @param **out** errors list of errors
// @return *on if ok, *off if error
///
dcl-pr testservice_getSupportedFields ind extproc(*dclcase);
  supportedFields likeDS(CMAGIC_supportedFields);
  errors likeDS(GLOBAL_listError);
end-pr;