     A*%%TS  SD  20240701  122210  GIYVOVIE    REL-V7R4M0  5770-WDS
     A**************************************************************************
     A**** Gestion des employés
     A**************************************************************************
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      REF(*LIBL/EMPLOYEE)
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03)
     A                                      CF05(05)
     A                                      CF06(06)
     A                                      CF12(12)
     A                                      CF09(09)
     A                                      CF10(10)
     A                                      CF04(04)
     A**************************************************************************
     A          R BASPAGE
     A                                      OVERLAY
     A            TFONCTIONS   125A  O 26  2COLOR(BLU)
     A            MSGERR       125A  O 27  2COLOR(RED)
     A N99                                  DSPATR(ND)
     A                                      MSGID(&WMSG FRSMSGF)
     A            WMSG           7A  P
     A**************************************************************************
     A          R SFL01                     SFL
     A*%%TS  SD  20240701  120904  GIYVOVIE    REL-V7R4M0  5770-WDS
     A                                      KEEP
     A            CHOIX          1A  B  8  2
     A  37                                  DSPATR(PC)
     A  37                                  DSPATR(RI)
     A  39                                  DSPATR(PR)
     A  39                                  DSPATR(ND)
     *********************************************************************
     **** TODO: 1.  Add the fields to the SFL record format.
     *********************************************************************
     A            CODE      R        O  8  6REFFLD(EMPNO)
     A            PRENOM    R        O  8 13REFFLD(FIRSTNME)
     A            NOM       R        O  8 26REFFLD(LASTNAME)
     A            INITIALE  R        O  8 42REFFLD(MIDINIT)
     A            SERVICE   R        O  8 45REFFLD(WORKDEPT)
     *********************************************************************
     **** ENDTODO: 
     *********************************************************************

     A**************************************************************************
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20240701  121652  GIYVOVIE    REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A N33                                  ROLLUP(35)
     A                                      RTNCSRLOC(&REC &FLD)
     A                                      BLINK
     A                                      OVERLAY
     A                                      SFLCSRRRN(&GRTRNG)
     A  30                                  SFLDSP
     A  31                                  SFLDSPCTL
     A  32                                  SFLCLR
     A  33                                  SFLEND(*MORE)
     A            GRTRNG         5S 0H
     A            POSPAGE        4S 0H      SFLRCDNBR(CURSOR)
     A            REC           10A  H
     A            FLD           10A  H
     A            LIG            3S 0H
     A            COL            3S 0H
     A            $NOMPGM       10A  O  1  2
     A                                  1 55'Gestion des employés'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            ENVIRONMNT    10   O  1 86
     A                                  1125DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2USER
     A            NOMETA        38A  O  2 14
     A            MODE          20A  O  2 86DSPATR(RI)
     A                                      COLOR(PNK)
     A                                  2125TIME
     A                                      COLOR(BLU)
     A            NOMAGE        38A  O  3 14
     A                                  3125SYSNAME
     A                                      DSPATR(HI)
     A                                      COLOR(RED)
     A                                  4  4'2=Modifier'
     A                                      COLOR(BLU)
     A                                  4 15'4=Supprimer'
     A                                      COLOR(BLU)
     A                                  4 27'5=Consulter'
     A                                      COLOR(BLU)
     *********************************************************************
     **** TODO: 1.  Add the filter fields of the SFL list.
     *********************************************************************
     A                                  6  6'N°    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6 13'Nom et prénom            '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6 45'Service'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            CODE      R        B  7  6REFFLD(EMPNO)
     A            PRENOM    R        B  7 13REFFLD(FIRSTNME)
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A            NOM       R        B  7 26REFFLD(LASTNAME)
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A            INITIALE  R        B  7 42REFFLD(MIDINIT)
     A                                      DSPATR(UL)
     A            SERVICE   R        B  7 45REFFLD(WORKDEPT)
     A                                      DSPATR(UL)
     *********************************************************************
     **** ENDTODO: 
     *********************************************************************

      **************************************************************************
     A          R FVIDE
     A                                      OVERLAY
     A                                 14 31'Aucun enregistrement'
     A                                      DSPATR(BL)
     A                                      COLOR(RED)
     A          R FMT02
     A*%%TS  SD  20240701  122210  GIYVOVIE    REL-V7R4M0  5770-WDS
     A                                      RTNCSRLOC(&REC &FLD)
     A                                      CSRLOC(ROW        COL)
     A            WMSG           7A  P
     A            REC           10A  H
     A            FLD           10A  H
     A            ROW            3S 0H
     A            COL            3S 0H
     A            $NOMPGM       10A  O  1  2
     A                                  1 55'Détail d''employé'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            ENVIRONMNT    10   O  1 86
     A                                  1125DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2USER
     A            NOMETA        38A  O  2 14
     A            MODE          20A  O  2 86DSPATR(RI)
     A                                      COLOR(PNK)
     A                                  2125TIME
     A                                      COLOR(BLU)
     A            NOMAGE        38A  O  3 14
     A                                  3125SYSNAME
     A                                      DSPATR(HI)
     A                                      COLOR(RED)
     *********************************************************************
     **** TODO: 1.  Add the mutable fields of the entities.
     ** the ID must be not mutable.
     *********************************************************************
     A                                  5  2'ID'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            CODE      R        O  5  5REFFLD(EMPNO)
     A                                 10  2'Nom'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            NOM       R        B 10  6REFFLD(LASTNAME)
     A  38                                  DSPATR(PR)
     A                                 12  2'Prénom'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            PRENOM    R        B 12  9REFFLD(FIRSTNME)
     A  38                                  DSPATR(PR)
     A                                 14  2'Initiale'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            INITIALE  R        B 14 11REFFLD(MIDINIT)
     A  38                                  DSPATR(PR)
     A                                 16  2'Service'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SERVICE   R        B 16 10REFFLD(WORKDEPT)
     A  38                                  DSPATR(PR)
     A                                 18  2'date embauche'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            DATEMBAUCHR        B 18 16REFFLD(HIREDATE)
     A  38                                  DSPATR(PR)
     A                                 19  2'date naissance'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            DATNAISSANR        B 19 17REFFLD(BIRTHDATE)
     A  38                                  DSPATR(PR)
     A                                 20  2'Genre'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            GENRE     R        B 20  8REFFLD(SEX)
     A  38                                  DSPATR(PR)
     A                                 21  2'salaire'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SALAIRE   R        B 21 10REFFLD(SALARY)
     A  38                                  DSPATR(PR) 
     *********************************************************************
     **** ENDTODO: 
     *********************************************************************
     A            TFONCTIONS   125A  O 26  2COLOR(BLU)
     A            MSGERR2      125A  O 27  2COLOR(RED)
     A N99                                  DSPATR(ND)
     A                                      MSGID(&WMSG FRSMSGF)
     A          R AUDIT
     A                                      WINDOW(5 5 10 70)
     A                                      WDWBORDER((*DSPATR HI RI) (*CHAR ' -
     A                                             '))
     A                                  2  2'AUDIT'
     A                                      COLOR(PNK)
     A                                  3 13'Le                       '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3 40'Qui      '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3 52'Par      '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4  2'Statut'
     A                                      COLOR(WHT)
     A                                  9 29'F12=Annuler'
     A                                      COLOR(BLU)
     A          R CONFIRM
     A                                      WINDOW(5 10 10 40)
     A                                      WDWBORDER((*DSPATR HI RI) (*CHAR ' -
     A                                             '))
     A                                  2  2'CONFIRMATION'
     A                                      COLOR(PNK)
     A            CONF1         38   O  4  2COLOR(RED)
     A            CONF2         38   O  5  2COLOR(RED)
     A            CONF3         38   O  6  2COLOR(RED)
     A            CONF4         38   O  7  2COLOR(RED)
     A                                  9  2'F9=CONFIRMER'
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                  9 29'F12=Annuler'
     A                                      COLOR(BLU)