**free
/if defined(SERVICE_ILEASTIC_H_DEFINED)
/eof
/endif
/define SERVICE_ILEASTIC_H_DEFINED
/include 'ileastic/ileastic.rpgle'

dcl-pr service_registerRoutes extproc(*dclcase);
  config likeDS(IL_config);
end-pr;
