**free
/if defined(FOURNIS_READ_H_DEFINED)
/eof
/endif
/define FOURNIS_READ_H_DEFINED
/include 'cmagic.rpgleinc'
/include 'global.rpgleinc'

dcl-ds fournis_item_t qualified template;
  id varchar(10);
  nom varchar(100);
  adresse varchar(160);
  ville varchar(80);
  telephone varchar(20);
  email varchar(254);
end-ds;

dcl-pr fournis_getSupportedFields ind extproc(*dclcase);
  pSupportedFields likeDS(CMAGIC_supportedFields);
  pErrors likeDS(GLOBAL_listError);
end-pr;

dcl-pr fournis_search ind extproc(*dclcase);
  pContext likeDS(CMAGIC_context) const;
  pTotalCount like(CMAGIC_totalCount);
  pItems pointer;
  pErrors likeDS(GLOBAL_listError);
end-pr;
dcl-ds fournis_detail_t qualified template;
  id varchar(10);
  nom varchar(100);
  adresse varchar(160);
  ville varchar(80);
  telephone varchar(20);
  email varchar(254);
end-ds;

dcl-pr fournis_get ind extproc(*dclcase);
  pId varchar(10) const;
  pDetail likeDS(fournis_detail_t);
  pErrors likeDS(GLOBAL_listError);
end-pr;
dcl-enum fournis_listeAction qualified;
  creation 'create';
  modification 'update';
end-enum;

dcl-pr fournis_isValid ind extproc(*dclcase);
  pAction like(GLOBAL_codeAction) const;
  pBeforeDetail likeDS(fournis_detail_t) const;
  pAfterDetail likeDS(fournis_detail_t) const;
  pErrors likeDS(GLOBAL_listError);
end-pr;

dcl-pr fournis_create ind extproc(*dclcase);
  pDetail likeDS(fournis_detail_t) const;
  pId varchar(10);
  pErrors likeDS(GLOBAL_listError);
end-pr;
dcl-pr fournis_update ind extproc(*dclcase);
  pId varchar(10) const;
  pDetail likeDS(fournis_detail_t) const;
  pErrors likeDS(GLOBAL_listError);
end-pr;
