**free
/if defined(SERVICE_READ_H_DEFINED)
/eof
/endif
/define SERVICE_READ_H_DEFINED
/include 'includes/cmagic.rpgleinc'
/include 'includes/global.rpgleinc'

dcl-ds service_item_t qualified template;
  id varchar(3);
  nom varchar(36);
  idManageur varchar(6);
  idServiceAdmin varchar(3);
  site varchar(16);
end-ds;

dcl-pr service_getSupportedFields ind extproc(*dclcase);
  pSupportedFields likeDS(CMAGIC_supportedFields);
  pErrors likeDS(GLOBAL_listError);
end-pr;

dcl-pr service_search ind extproc(*dclcase);
  pContext likeDS(CMAGIC_context) const;
  pTotalCount like(CMAGIC_totalCount);
  pItems pointer;
  pErrors likeDS(GLOBAL_listError);
end-pr;
dcl-ds service_detail_t qualified template;
  id varchar(3);
  nom varchar(36);
  idManageur varchar(6);
  idServiceAdmin varchar(3);
  site varchar(16);
end-ds;

dcl-pr service_get ind extproc(*dclcase);
  pId varchar(3) const;
  pDetail likeDS(service_detail_t);
  pErrors likeDS(GLOBAL_listError);
end-pr;
dcl-enum service_listeAction qualified;
  creation 'create';
  modification 'update';
  suppression 'delete';
end-enum;

dcl-pr service_isValid ind extproc(*dclcase);
  pAction like(GLOBAL_codeAction) const;
  pBeforeDetail likeDS(service_detail_t) const;
  pAfterDetail likeDS(service_detail_t) const;
  pErrors likeDS(GLOBAL_listError);
end-pr;

dcl-pr service_create ind extproc(*dclcase);
  pDetail likeDS(service_detail_t) const;
  pId varchar(3);
  pErrors likeDS(GLOBAL_listError);
end-pr;
dcl-pr service_update ind extproc(*dclcase);
  pId varchar(3) const;
  pDetail likeDS(service_detail_t) const;
  pErrors likeDS(GLOBAL_listError);
end-pr;
dcl-pr service_delete ind extproc(*dclcase);
  pId varchar(3) const;
  pErrors likeDS(GLOBAL_listError);
end-pr;
